xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_ll_system.h
/**
  ******************************************************************************
  * @file    py32l090_ll_system.h
  * @author  MCU Application Team
  * @brief   Header file of SYSTEM LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef PY32L090_LL_SYSTEM_H
#define PY32L090_LL_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32l0xx.h"

/** @addtogroup PY32L090_LL_Driver
  * @{
  */

#if defined (FLASH) || defined (SYSCFG) || defined (DBGMCU) || defined (VREFBUF)

/** @defgroup SYSTEM_LL SYSTEM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Private_Constants SYSTEM Private Constants
  * @{
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Constants SYSTEM Exported Constants
  * @{
  */

/** @defgroup SYSTEM_LL_EC_REMAP SYSCFG REMAP
  * @{
  */
#define LL_SYSCFG_REMAP_FLASH               0x00000000U                                           /*!< Main Flash memory mapped at 0x00000000 */
#define LL_SYSCFG_REMAP_SYSTEMFLASH         SYSCFG_CFGR1_MEM_MODE_0                               /*!< System Flash memory mapped at 0x00000000 */
#define LL_SYSCFG_REMAP_SRAM                (SYSCFG_CFGR1_MEM_MODE_1 | SYSCFG_CFGR1_MEM_MODE_0)   /*!< Embedded SRAM mapped at 0x00000000 */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_I2C_ANF I2C ANALOG FILTER ENABLE CONTORL
  * @{
  */
#define LL_SYSCFG_I2C_ANF_PA11           SYSCFG_IOCFG_PA_EIIC_0
#define LL_SYSCFG_I2C_ANF_PA12           SYSCFG_IOCFG_PA_EIIC_1
#define LL_SYSCFG_I2C_ANF_PA13           SYSCFG_IOCFG_PA_EIIC_2
#define LL_SYSCFG_I2C_ANF_PA14           SYSCFG_IOCFG_PA_EIIC_3
#define LL_SYSCFG_I2C_ANF_PB4            SYSCFG_IOCFG_PB_EIIC_0
#define LL_SYSCFG_I2C_ANF_PB5            SYSCFG_IOCFG_PB_EIIC_1
#define LL_SYSCFG_I2C_ANF_PB8            SYSCFG_IOCFG_PB_EIIC_2
#define LL_SYSCFG_I2C_ANF_PB9            SYSCFG_IOCFG_PB_EIIC_3
#define LL_SYSCFG_I2C_ANF_PB12           SYSCFG_IOCFG_PB_EIIC_4
#define LL_SYSCFG_I2C_ANF_PB13           SYSCFG_IOCFG_PB_EIIC_5
#define LL_SYSCFG_I2C_ANF_PC5            SYSCFG_IOCFG_PC_EIIC_0
#define LL_SYSCFG_I2C_ANF_PC6            SYSCFG_IOCFG_PC_EIIC_1
#define LL_SYSCFG_I2C_ANF_PC7            SYSCFG_IOCFG_PC_EIIC_2
#define LL_SYSCFG_I2C_ANF_PC9            SYSCFG_IOCFG_PC_EIIC_3
#define LL_SYSCFG_I2C_ANF_PC10           SYSCFG_IOCFG_PC_EIIC_4
#define LL_SYSCFG_I2C_ANF_PC12           SYSCFG_IOCFG_PC_EIIC_5
#define LL_SYSCFG_I2C_ANF_PC13           SYSCFG_IOCFG_PC_EIIC_6
#define LL_SYSCFG_I2C_ANF_PC14           SYSCFG_IOCFG_PC_EIIC_7
#define LL_SYSCFG_I2C_ANF_PC15           SYSCFG_IOCFG_PC_EIIC_8
#define LL_SYSCFG_I2C_ANF_PD6            SYSCFG_IOCFG_PD_EIIC_0
#define LL_SYSCFG_I2C_ANF_PD7            SYSCFG_IOCFG_PD_EIIC_1
#define LL_SYSCFG_I2C_ANF_PD10           SYSCFG_IOCFG_PD_EIIC_10
#define LL_SYSCFG_I2C_ANF_PD11           SYSCFG_IOCFG_PD_EIIC_11
#define LL_SYSCFG_I2C_ANF_PD14           SYSCFG_IOCFG_PD_EIIC_2
#define LL_SYSCFG_I2C_ANF_PD15           SYSCFG_IOCFG_PD_EIIC_3

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TIMBREAK SYSCFG TIMER BREAK
  * @{
  */
#if defined(SYSCFG_CFGR2_ECCL)
#define LL_SYSCFG_TIMBREAK_ECC             SYSCFG_CFGR2_ECCL  /*!< Enables and locks the ECC error signal 
                                                                   with Break Input of TIM1/15/16/17/PWM                           */
#endif
#if defined(SYSCFG_CFGR2_PVDL)
#define LL_SYSCFG_TIMBREAK_PVD             SYSCFG_CFGR2_PVDL  /*!< Enables and locks the PVD connection 
                                                                   with TIM1/15/16/17/PWM Break Input 
                                                                   and also the PVDE and PLS bits of the Power Control Interface */
#endif
#if defined(SYSCFG_CFGR2_SPL)
#define LL_SYSCFG_TIMBREAK_SRAM_PARITY     SYSCFG_CFGR2_SPL   /*!< Enables and locks the SRAM_PARITY error signal 
                                                                   with Break Input of TIM1/15/16/17/PWM                           */
#endif
#if defined(SYSCFG_CFGR2_CLL)
#define LL_SYSCFG_TIMBREAK_LOCKUP          SYSCFG_CFGR2_CLL   /*!< Enables and locks the LOCKUP output of CortexM0 
                                                                   with Break Input of TIM1/15/16/17/PWM                             */
#endif
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_DMA_MAP DMA MAP
  * @{
  */
#define LL_SYSCFG_DMA_MAP_ADC               0x00000000U
#if defined(DAC)
#define LL_SYSCFG_DMA_MAP_DAC               0x00000001U
#endif /* DAC */
#define LL_SYSCFG_DMA_MAP_SPI1_RX           0x00000003U
#define LL_SYSCFG_DMA_MAP_SPI1_TX           0x00000004U
#define LL_SYSCFG_DMA_MAP_SPI2_RX           0x00000005U
#define LL_SYSCFG_DMA_MAP_SPI2_TX           0x00000006U
#define LL_SYSCFG_DMA_MAP_USART1_RX         0x00000007U
#define LL_SYSCFG_DMA_MAP_USART1_TX         0x00000008U
#define LL_SYSCFG_DMA_MAP_USART2_RX         0x00000009U
#define LL_SYSCFG_DMA_MAP_USART2_TX         0x0000000AU
#define LL_SYSCFG_DMA_MAP_UART1_RX          0x0000000BU
#define LL_SYSCFG_DMA_MAP_UART1_TX          0x0000000CU
#define LL_SYSCFG_DMA_MAP_LPUART1_RX        0x0000000DU
#define LL_SYSCFG_DMA_MAP_LPUART1_TX        0x0000000EU
#define LL_SYSCFG_DMA_MAP_I2C1_RX           0x0000000FU
#define LL_SYSCFG_DMA_MAP_I2C1_TX           0x00000010U
#define LL_SYSCFG_DMA_MAP_I2C2_RX           0x00000011U
#define LL_SYSCFG_DMA_MAP_I2C2_TX           0x00000012U
#define LL_SYSCFG_DMA_MAP_TIM1_CH1          0x00000013U
#define LL_SYSCFG_DMA_MAP_TIM1_CH2          0x00000014U
#define LL_SYSCFG_DMA_MAP_TIM1_CH3          0x00000015U
#define LL_SYSCFG_DMA_MAP_TIM1_CH4          0x00000016U
#define LL_SYSCFG_DMA_MAP_TIM1_COM          0x00000017U
#define LL_SYSCFG_DMA_MAP_TIM1_TRG         0x00000018U
#define LL_SYSCFG_DMA_MAP_TIM1_UP           0x00000019U
#define LL_SYSCFG_DMA_MAP_TIM2_CH1          0x0000001AU
#define LL_SYSCFG_DMA_MAP_TIM2_CH2          0x0000001BU
#define LL_SYSCFG_DMA_MAP_TIM2_CH3          0x0000001CU
#define LL_SYSCFG_DMA_MAP_TIM2_CH4          0x0000001DU
#define LL_SYSCFG_DMA_MAP_TIM2_UP           0x0000001EU
#define LL_SYSCFG_DMA_MAP_TIM2_TRG         0x0000001FU
#define LL_SYSCFG_DMA_MAP_TIM3_CH1          0x00000020U
#define LL_SYSCFG_DMA_MAP_TIM3_CH2          0x00000021U
#define LL_SYSCFG_DMA_MAP_TIM3_CH3          0x00000022U
#define LL_SYSCFG_DMA_MAP_TIM3_CH4          0x00000023U
#define LL_SYSCFG_DMA_MAP_TIM3_UP           0x00000024U
#define LL_SYSCFG_DMA_MAP_TIM3_TRG         0x00000025U
#define LL_SYSCFG_DMA_MAP_TIM6_UP           0x00000026U
#define LL_SYSCFG_DMA_MAP_TIM7_UP           0x00000027U
#define LL_SYSCFG_DMA_MAP_TIM15_CH1         0x00000028U
#define LL_SYSCFG_DMA_MAP_TIM15_CH2         0x00000029U
#define LL_SYSCFG_DMA_MAP_TIM15_UP          0x0000002AU
#define LL_SYSCFG_DMA_MAP_TIM15_TRG        0x0000002BU
#define LL_SYSCFG_DMA_MAP_TIM15_COM         0x0000002CU
#define LL_SYSCFG_DMA_MAP_TIM16_CH1         0x0000002DU
#define LL_SYSCFG_DMA_MAP_TIM16_UP          0x0000002EU
#define LL_SYSCFG_DMA_MAP_TIM17_CH1         0x0000002FU
#define LL_SYSCFG_DMA_MAP_TIM17_UP          0x00000030U
#define LL_SYSCFG_DMA_MAP_LPUART2_RX        0x00000032U
#define LL_SYSCFG_DMA_MAP_LPUART2_TX        0x00000033U
#define LL_SYSCFG_DMA_MAP_PWM_CH1           0x00000034U
#define LL_SYSCFG_DMA_MAP_PWM_CH2           0x00000035U
#define LL_SYSCFG_DMA_MAP_PWM_CH3           0x00000036U
#define LL_SYSCFG_DMA_MAP_PWM_CH4           0x00000037U
#define LL_SYSCFG_DMA_MAP_PWM_UP            0x00000038U
#define LL_SYSCFG_DMA_MAP_UART2_RX          0x00000039U
#define LL_SYSCFG_DMA_MAP_UART2_TX          0x0000003AU
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_GPIO_PORT GPIO PORT
  * @{
  */
#define LL_SYSCFG_GPIO_PORTA              0x00000000U
#define LL_SYSCFG_GPIO_PORTB              0x00000001U
#define LL_SYSCFG_GPIO_PORTC              0x00000002U
#define LL_SYSCFG_GPIO_PORTD              0x00000003U
/**
  * @}
  */
  
/** @defgroup SYSTEM_LL_EC_GPIO_PIN GPIO PIN
  * @{
  */
#define LL_SYSCFG_GPIO_PIN_0              0x00000001U
#define LL_SYSCFG_GPIO_PIN_1              0x00000002U
#define LL_SYSCFG_GPIO_PIN_2              0x00000004U
#define LL_SYSCFG_GPIO_PIN_3              0x00000008U
#define LL_SYSCFG_GPIO_PIN_4              0x00000010U
#define LL_SYSCFG_GPIO_PIN_5              0x00000020U
#define LL_SYSCFG_GPIO_PIN_6              0x00000040U
#define LL_SYSCFG_GPIO_PIN_7              0x00000080U
#define LL_SYSCFG_GPIO_PIN_8              0x00000100U
#define LL_SYSCFG_GPIO_PIN_9              0x00000200U
#define LL_SYSCFG_GPIO_PIN_10             0x00000400U
#define LL_SYSCFG_GPIO_PIN_11             0x00000800U
#define LL_SYSCFG_GPIO_PIN_12             0x00001000U
#define LL_SYSCFG_GPIO_PIN_13             0x00002000U
#define LL_SYSCFG_GPIO_PIN_14             0x00004000U
#define LL_SYSCFG_GPIO_PIN_15             0x00008000U
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_SRAM_PARITY_ERROR_RESPONSE_MODE SRAM PARITY ERROR RESPONSE MODE
  * @{
  */
#define LL_SYSCFPG_RESPONSE_MODE_NMI    0x00000000U
#define LL_SYSCFPG_RESPONSE_MODE_RESET  SYSCFG_SCSR_PERR_RSTEN
/**
  * @}
  */
  
/** @defgroup SYSTEM_LL_EC_CCMSRAMWRP SYSCFG CCMSRAM WRP
  * @{
  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE0         SYSCFG_SWPR_SRAM_P0WP  /*!< CCMSRAM Write protection page 0  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE1         SYSCFG_SWPR_SRAM_P1WP  /*!< CCMSRAM Write protection page 1  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE2         SYSCFG_SWPR_SRAM_P2WP  /*!< CCMSRAM Write protection page 2  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE3         SYSCFG_SWPR_SRAM_P3WP  /*!< CCMSRAM Write protection page 3  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE4         SYSCFG_SWPR_SRAM_P4WP  /*!< CCMSRAM Write protection page 4  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE5         SYSCFG_SWPR_SRAM_P5WP  /*!< CCMSRAM Write protection page 5  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE6         SYSCFG_SWPR_SRAM_P6WP  /*!< CCMSRAM Write protection page 6  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE7         SYSCFG_SWPR_SRAM_P7WP  /*!< CCMSRAM Write protection page 7  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE8         SYSCFG_SWPR_SRAM_P8WP  /*!< CCMSRAM Write protection page 8  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE9         SYSCFG_SWPR_SRAM_P9WP  /*!< CCMSRAM Write protection page 9  */
#define LL_SYSCFG_CCMSRAMWRP_PAGE10        SYSCFG_SWPR_SRAM_P10WP /*!< CCMSRAM Write protection page 10 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE11        SYSCFG_SWPR_SRAM_P11WP /*!< CCMSRAM Write protection page 11 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE12        SYSCFG_SWPR_SRAM_P12WP /*!< CCMSRAM Write protection page 12 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE13        SYSCFG_SWPR_SRAM_P13WP /*!< CCMSRAM Write protection page 13 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE14        SYSCFG_SWPR_SRAM_P14WP /*!< CCMSRAM Write protection page 14 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE15        SYSCFG_SWPR_SRAM_P15WP /*!< CCMSRAM Write protection page 15 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE16        SYSCFG_SWPR_SRAM_P16WP /*!< CCMSRAM Write protection page 16 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE17        SYSCFG_SWPR_SRAM_P17WP /*!< CCMSRAM Write protection page 17 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE18        SYSCFG_SWPR_SRAM_P18WP /*!< CCMSRAM Write protection page 18 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE19        SYSCFG_SWPR_SRAM_P19WP /*!< CCMSRAM Write protection page 19 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE20        SYSCFG_SWPR_SRAM_P20WP /*!< CCMSRAM Write protection page 20 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE21        SYSCFG_SWPR_SRAM_P21WP /*!< CCMSRAM Write protection page 21 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE22        SYSCFG_SWPR_SRAM_P22WP /*!< CCMSRAM Write protection page 22 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE23        SYSCFG_SWPR_SRAM_P23WP /*!< CCMSRAM Write protection page 23 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE24        SYSCFG_SWPR_SRAM_P24WP /*!< CCMSRAM Write protection page 24 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE25        SYSCFG_SWPR_SRAM_P25WP /*!< CCMSRAM Write protection page 25 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE26        SYSCFG_SWPR_SRAM_P26WP /*!< CCMSRAM Write protection page 26 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE27        SYSCFG_SWPR_SRAM_P27WP /*!< CCMSRAM Write protection page 27 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE28        SYSCFG_SWPR_SRAM_P28WP /*!< CCMSRAM Write protection page 28 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE29        SYSCFG_SWPR_SRAM_P29WP /*!< CCMSRAM Write protection page 29 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE30        SYSCFG_SWPR_SRAM_P30WP /*!< CCMSRAM Write protection page 30 */
#define LL_SYSCFG_CCMSRAMWRP_PAGE31        SYSCFG_SWPR_SRAM_P31WP /*!< CCMSRAM Write protection page 31 */
/**
  * @}
  */
  
/** @defgroup SYSTEM_LL_GPIO_SEL GPIO SEL
  * @{
  */
#define LL_SYSCFG_GPIO_SEL_FASTIO          0x00000000U 
#define LL_SYSCFG_GPIO_SEL_AHB             SYSCFG_CFGR1_GPIO_AHB_SEL
/**
  * @}
  */
  
