xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_ll_system.h
  }
}

/**
  * @brief  Disable GPIO Filter
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOPort This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PORTA
  *         @arg @ref LL_SYSCFG_GPIO_PORTB
  *         @arg @ref LL_SYSCFG_GPIO_PORTC
  *         @arg @ref LL_SYSCFG_GPIO_PORTD
  * @param  GPIOPin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PIN_0
  *         @arg @ref LL_SYSCFG_GPIO_PIN_1
  *         @arg @ref LL_SYSCFG_GPIO_PIN_2
  *         @arg @ref LL_SYSCFG_GPIO_PIN_3
  *         @arg @ref LL_SYSCFG_GPIO_PIN_4
  *         @arg @ref LL_SYSCFG_GPIO_PIN_5
  *         @arg @ref LL_SYSCFG_GPIO_PIN_6
  *         @arg @ref LL_SYSCFG_GPIO_PIN_7
  *         @arg @ref LL_SYSCFG_GPIO_PIN_8
  *         @arg @ref LL_SYSCFG_GPIO_PIN_9
  *         @arg @ref LL_SYSCFG_GPIO_PIN_10
  *         @arg @ref LL_SYSCFG_GPIO_PIN_11
  *         @arg @ref LL_SYSCFG_GPIO_PIN_12
  *         @arg @ref LL_SYSCFG_GPIO_PIN_13
  *         @arg @ref LL_SYSCFG_GPIO_PIN_14
  *         @arg @ref LL_SYSCFG_GPIO_PIN_15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableGPIOFilter(uint32_t GPIOPort, uint32_t GPIOPin)
{
  if(GPIOPort == LL_SYSCFG_GPIO_PORTA)
  {
    CLEAR_BIT(SYSCFG->PA_ENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTB)
  {
    CLEAR_BIT(SYSCFG->PB_ENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTC)
  {    
    CLEAR_BIT(SYSCFG->PC_ENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTD)
  {    
    CLEAR_BIT(SYSCFG->PD_ENS, GPIOPin);
  }
  else
  {
    
  }
}

/**
  * @brief  Check if GPIO Filter is enabled
  * @param  GPIOPort This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PORTA
  *         @arg @ref LL_SYSCFG_GPIO_PORTB
  *         @arg @ref LL_SYSCFG_GPIO_PORTC
  *         @arg @ref LL_SYSCFG_GPIO_PORTD
  * @param  GPIOPin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PIN_0
  *         @arg @ref LL_SYSCFG_GPIO_PIN_1
  *         @arg @ref LL_SYSCFG_GPIO_PIN_2
  *         @arg @ref LL_SYSCFG_GPIO_PIN_3
  *         @arg @ref LL_SYSCFG_GPIO_PIN_4
  *         @arg @ref LL_SYSCFG_GPIO_PIN_5
  *         @arg @ref LL_SYSCFG_GPIO_PIN_6
  *         @arg @ref LL_SYSCFG_GPIO_PIN_7
  *         @arg @ref LL_SYSCFG_GPIO_PIN_8
  *         @arg @ref LL_SYSCFG_GPIO_PIN_9
  *         @arg @ref LL_SYSCFG_GPIO_PIN_10
  *         @arg @ref LL_SYSCFG_GPIO_PIN_11
  *         @arg @ref LL_SYSCFG_GPIO_PIN_12
  *         @arg @ref LL_SYSCFG_GPIO_PIN_13
  *         @arg @ref LL_SYSCFG_GPIO_PIN_14
  *         @arg @ref LL_SYSCFG_GPIO_PIN_15
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledGPIOFilter(uint32_t GPIOPort, uint32_t GPIOPin)
{
  uint32_t temp = 0;
  
  if(GPIOPort == LL_SYSCFG_GPIO_PORTA)
  {
    temp = READ_BIT(SYSCFG->PA_ENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTB)
  {
    temp = READ_BIT(SYSCFG->PB_ENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTC)
  {    
    temp = READ_BIT(SYSCFG->PC_ENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTD)
  {    
    temp = READ_BIT(SYSCFG->PD_ENS, GPIOPin);
  }
  else
  {
    
  }
  
  return ((temp == (GPIOPin)) ? 1U:0U);
}

/**
  * @brief  Enable analog filtering of I2C related IO
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA11 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA12 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA13 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA14 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB4  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB5  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB8  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB9  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB12 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB13 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC5  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC6  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC7  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC9  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC10 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC12 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC13 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC14 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC15 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD6  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD7  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD10 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD11 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD14 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD15 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  SET_BIT(SYSCFG->IOCFG, I2CAnalogFilter);
}

/**
  * @brief  Disable analog filtering of I2C related IO
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA11 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA12 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA13 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA14 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB4  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB5  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB8  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB9  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB12 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB13 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC5  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC6  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC7  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC9  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC10 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC12 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC13 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC14 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC15 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD6  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD7  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD10 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD11 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD14 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD15 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  CLEAR_BIT(SYSCFG->IOCFG, I2CAnalogFilter);
}

/**
  * @brief  Indicate if analog filtering of I2C related IO is enabled
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA11 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA12 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA13 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PA14 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB4  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB5  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB8  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB9  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB12 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB13 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC5  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC6  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC7  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC9  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC10 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC12 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC13 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC14 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PC15 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD6  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD7  
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD10 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD11 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD14 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PD15 
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  return ((READ_BIT(SYSCFG->IOCFG, I2CAnalogFilter) == (I2CAnalogFilter)) ? 1UL : 0UL);
}

/**
  * @brief  Enable I2C pin pull-up.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_PU_IIC_PD14
  *            @arg LL_SYSCFG_PU_IIC_PD15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableI2CPinPullUp(uint32_t PORT_Pin)
{
  SET_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Disable I2C pin pull-up.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_PU_IIC_PD14
  *            @arg LL_SYSCFG_PU_IIC_PD15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableI2CPinPullUp(uint32_t PORT_Pin)
{
  CLEAR_BIT(SYSCFG->IOCFG, PORT_Pin);
}

/**
  * @brief  Check if I2C pin pull-up is enabled
  * @param  PORT_Pin specifies the pin
  *         This parameter can be one of the following values:
  *            @arg LL_SYSCFG_PU_IIC_PD14
  *            @arg LL_SYSCFG_PU_IIC_PD15
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledI2CPinPullUp(uint32_t PORT_Pin)
{
  return ((READ_BIT(SYSCFG->IOCFG, PORT_Pin) == (PORT_Pin)) ? 1UL : 0UL);
}

/**
  * @brief  Enable high driving capability of LED pins.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_EHS_PB2 
  *            @arg LL_SYSCFG_EHS_PB3 
  *            @arg LL_SYSCFG_EHS_PB4 
  *            @arg LL_SYSCFG_EHS_PB5 
  *            @arg LL_SYSCFG_EHS_PB6 
  *            @arg LL_SYSCFG_EHS_PB7 
  *            @arg LL_SYSCFG_EHS_PB8 
  *            @arg LL_SYSCFG_EHS_PB9 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableLEDPinHighDrvSignal(uint32_t PORT_Pin)
{
  SET_BIT(SYSCFG->LEDCFG, PORT_Pin);
}

/**
  * @brief  Disable high driving capability of LED pins.
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_EHS_PB2 
  *            @arg LL_SYSCFG_EHS_PB3 
  *            @arg LL_SYSCFG_EHS_PB4 
  *            @arg LL_SYSCFG_EHS_PB5 
  *            @arg LL_SYSCFG_EHS_PB6 
  *            @arg LL_SYSCFG_EHS_PB7 
  *            @arg LL_SYSCFG_EHS_PB8 
  *            @arg LL_SYSCFG_EHS_PB9 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableLEDPinHighDrvSignal(uint32_t PORT_Pin)
{
  CLEAR_BIT(SYSCFG->LEDCFG, PORT_Pin);
}

/**
  * @brief  Check if high driving capability of LED pins is enabled
  * @param  PORT_Pin specifies the pin
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_EHS_PB2 
  *            @arg LL_SYSCFG_EHS_PB3 
  *            @arg LL_SYSCFG_EHS_PB4 
  *            @arg LL_SYSCFG_EHS_PB5 
  *            @arg LL_SYSCFG_EHS_PB6 
  *            @arg LL_SYSCFG_EHS_PB7 
  *            @arg LL_SYSCFG_EHS_PB8 
  *            @arg LL_SYSCFG_EHS_PB9 
  * @retval None
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledLEDPinHighDrvSignal(uint32_t PORT_Pin)
{
  return ((READ_BIT(SYSCFG->LEDCFG, PORT_Pin) == (PORT_Pin)) ? 1UL : 0UL);
}

/**
  * @brief  Enable SEG Constant Current Source.
  * @param  SEGx specifies the seg
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_SEGIS_EN_0
  *            @arg LL_SYSCFG_SEGIS_EN_1
  *            @arg LL_SYSCFG_SEGIS_EN_2
  *            @arg LL_SYSCFG_SEGIS_EN_3
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableSEGConstantCurrentSource(uint32_t SEGx)
{
  SET_BIT(SYSCFG->LEDCFG, SEGx);
}

/**
  * @brief  Disable SEG Constant Current Source.
  * @param  SEGx specifies the seg
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_SEGIS_EN_0 
  *            @arg LL_SYSCFG_SEGIS_EN_1 
  *            @arg LL_SYSCFG_SEGIS_EN_2 
  *            @arg LL_SYSCFG_SEGIS_EN_3 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableSEGConstantCurrentSource(uint32_t SEGx)
{
  CLEAR_BIT(SYSCFG->LEDCFG, SEGx);
}

/**
  * @brief  Check if SEG Constant Current Source is enabled
  * @param  SEGx specifies the seg
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_SEGIS_EN_0
  *            @arg LL_SYSCFG_SEGIS_EN_1
  *            @arg LL_SYSCFG_SEGIS_EN_2
  *            @arg LL_SYSCFG_SEGIS_EN_3
  * @retval None
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledSEGConstantCurrentSource(uint32_t SEGx)
{
  return ((READ_BIT(SYSCFG->LEDCFG, SEGx) == (SEGx)) ? 1UL : 0UL);
}

/**
  * @brief  Enable GPIO Constant Current Source.
  * @param  GPIOx specifies the GPIO
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_ENSEG_PB2 
  *            @arg LL_SYSCFG_ENSEG_PB3 
  *            @arg LL_SYSCFG_ENSEG_PB4 
  *            @arg LL_SYSCFG_ENSEG_PB5 
  *            @arg LL_SYSCFG_ENSEG_PB6 
  *            @arg LL_SYSCFG_ENSEG_PB7 
  *            @arg LL_SYSCFG_ENSEG_PB8 
  *            @arg LL_SYSCFG_ENSEG_PB9 
  *            @arg LL_SYSCFG_ENSEG_PB10
  *            @arg LL_SYSCFG_ENSEG_PB11
  *            @arg LL_SYSCFG_ENSEG_PB12
  *            @arg LL_SYSCFG_ENSEG_PB13
  *            @arg LL_SYSCFG_ENSEG_PB14
  *            @arg LL_SYSCFG_ENSEG_PB15
  *            @arg LL_SYSCFG_ENSEG_PC0 
  *            @arg LL_SYSCFG_ENSEG_PC1 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableGPIOConstantCurrentSource(uint32_t GPIOx)
{
  SET_BIT(SYSCFG->LEDCFG, GPIOx);
}

/**
  * @brief  Disable GPIO Constant Current Source..
  * @param  GPIOx specifies the seg
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_ENSEG_PB2 
  *            @arg LL_SYSCFG_ENSEG_PB3 
  *            @arg LL_SYSCFG_ENSEG_PB4 
  *            @arg LL_SYSCFG_ENSEG_PB5 
  *            @arg LL_SYSCFG_ENSEG_PB6 
  *            @arg LL_SYSCFG_ENSEG_PB7 
  *            @arg LL_SYSCFG_ENSEG_PB8 
  *            @arg LL_SYSCFG_ENSEG_PB9 
  *            @arg LL_SYSCFG_ENSEG_PB10
  *            @arg LL_SYSCFG_ENSEG_PB11
  *            @arg LL_SYSCFG_ENSEG_PB12
  *            @arg LL_SYSCFG_ENSEG_PB13
  *            @arg LL_SYSCFG_ENSEG_PB14
  *            @arg LL_SYSCFG_ENSEG_PB15
  *            @arg LL_SYSCFG_ENSEG_PC0 
  *            @arg LL_SYSCFG_ENSEG_PC1 
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableGPIOConstantCurrentSource(uint32_t GPIOx)
{
  CLEAR_BIT(SYSCFG->LEDCFG, GPIOx);
}

/**
  * @brief  Check if GPIO Constant Current Source is enabled
  * @param  GPIOx specifies the GPIO
  *         This parameter can be any combination of the following values:
  *            @arg LL_SYSCFG_ENSEG_PB2 
  *            @arg LL_SYSCFG_ENSEG_PB3 
  *            @arg LL_SYSCFG_ENSEG_PB4 
  *            @arg LL_SYSCFG_ENSEG_PB5 
  *            @arg LL_SYSCFG_ENSEG_PB6 
  *            @arg LL_SYSCFG_ENSEG_PB7 
  *            @arg LL_SYSCFG_ENSEG_PB8 
  *            @arg LL_SYSCFG_ENSEG_PB9 
  *            @arg LL_SYSCFG_ENSEG_PB10
  *            @arg LL_SYSCFG_ENSEG_PB11
  *            @arg LL_SYSCFG_ENSEG_PB12
  *            @arg LL_SYSCFG_ENSEG_PB13
  *            @arg LL_SYSCFG_ENSEG_PB14
  *            @arg LL_SYSCFG_ENSEG_PB15
  *            @arg LL_SYSCFG_ENSEG_PC0 
  *            @arg LL_SYSCFG_ENSEG_PC1 
  * @retval None
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledGPIOConstantCurrentSource(uint32_t GPIOx)
{
  return ((READ_BIT(SYSCFG->LEDCFG, GPIOx) == (GPIOx)) ? 1UL : 0UL);
}

/**
  * @brief  Enable GPIO Analog2
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOPort This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PORTA
  *         @arg @ref LL_SYSCFG_GPIO_PORTB
  *         @arg @ref LL_SYSCFG_GPIO_PORTC
  *         @arg @ref LL_SYSCFG_GPIO_PORTD
  * @param  GPIOPin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PIN_0
  *         @arg @ref LL_SYSCFG_GPIO_PIN_1
  *         @arg @ref LL_SYSCFG_GPIO_PIN_2
  *         @arg @ref LL_SYSCFG_GPIO_PIN_3
  *         @arg @ref LL_SYSCFG_GPIO_PIN_4
  *         @arg @ref LL_SYSCFG_GPIO_PIN_5
  *         @arg @ref LL_SYSCFG_GPIO_PIN_6
  *         @arg @ref LL_SYSCFG_GPIO_PIN_7
  *         @arg @ref LL_SYSCFG_GPIO_PIN_8
  *         @arg @ref LL_SYSCFG_GPIO_PIN_9
  *         @arg @ref LL_SYSCFG_GPIO_PIN_10
  *         @arg @ref LL_SYSCFG_GPIO_PIN_11
  *         @arg @ref LL_SYSCFG_GPIO_PIN_12
  *         @arg @ref LL_SYSCFG_GPIO_PIN_13
  *         @arg @ref LL_SYSCFG_GPIO_PIN_14
  *         @arg @ref LL_SYSCFG_GPIO_PIN_15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableGPIOAnalog2(uint32_t GPIOPort, uint32_t GPIOPin) 
{
  if(GPIOPort == LL_SYSCFG_GPIO_PORTA)
  {
    SET_BIT(SYSCFG->PA_ANA2EN, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTB)
  {
    SET_BIT(SYSCFG->PB_ANA2EN, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTC)
  {
    SET_BIT(SYSCFG->PC_ANA2EN, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTD)
  {
    SET_BIT(SYSCFG->PD_ANA2EN, GPIOPin);
  }
  else
  {
    
